In [3]:
import pandas as pd
import numpy as np

In [80]:
dict_1={
    "Name":["Barney","Ted","Robin","Marshall"],
    "Sport":["Running","Swimming","Running","Basketball"],
    "Calories":[134,356,563,455]
}

In [82]:
dataFrame_1=pd.DataFrame(dict_1,index=[0,1,2,3])

In [84]:
dataFrame_1

       Name       Sport  Calories
0    Barney     Running       134
1       Ted    Swimming       356
2     Robin     Running       563
3  Marshall  Basketball       455

In [86]:
dict_2={
    "Name":["Claire","Phil","Luke","Alex","Haley"],
    "Sport":["Archery","Athletics","Billiards","Bowling","Climbing"],
    "Calories":[114,556,993,235,222]
}

In [88]:
dataFrame_2=pd.DataFrame(dict_2,index=[4,5,6,7,8])

In [90]:
dataFrame_2

     Name      Sport  Calories
4  Claire    Archery       114
5    Phil  Athletics       556
6    Luke  Billiards       993
7    Alex    Bowling       235
8   Haley   Climbing       222

In [92]:
dict_3={
    "Name":["Gloria","Jay","Manny","Stella","Joe"],
    "Sport":["Fitness","Golf","Hokey","Parkour","Running"],
    "Calories":[432,765,984,123,134]
}

In [94]:
dataFrame_3=pd.DataFrame(dict_3,index=[9,10,11,12,13])

In [96]:
dataFrame_3

      Name    Sport  Calories
9   Gloria  Fitness       432
10     Jay     Golf       765
11   Manny    Hokey       984
12  Stella  Parkour       123
13     Joe  Running       134

## Concatenation

In [99]:
pd.concat([dataFrame_1,dataFrame_2,dataFrame_3],axis=0) ## joins data side by side if axis is specified as 1

        Name       Sport  Calories
0     Barney     Running       134
1        Ted    Swimming       356
2      Robin     Running       563
3   Marshall  Basketball       455
4     Claire     Archery       114
5       Phil   Athletics       556
6       Luke   Billiards       993
7       Alex     Bowling       235
8      Haley    Climbing       222
9     Gloria     Fitness       432
10       Jay        Golf       765
11     Manny       Hokey       984
12    Stella     Parkour       123
13       Joe     Running       134

## Merge

In [102]:
mergeDict_1={"Name":["Mitchell","Cameron","Lily"],
            "Sports":["Swimming","Golf","Parkour"],
             
            }

In [104]:
mergeDataFrame_1=pd.DataFrame(mergeDict_1)

In [106]:
mergeDataFrame_1

       Name    Sports
0  Mitchell  Swimming
1   Cameron      Golf
2      Lily   Parkour

In [110]:
mergeDict_2={"Name":["Mitchell","Cameron","Lily"],
            "Calories":[356,765,123]
            }

In [114]:
mergeDataFrame_2=pd.DataFrame(mergeDict_2)

In [116]:
mergeDataFrame_2

       Name  Calories
0  Mitchell       356
1   Cameron       765
2      Lily       123

In [118]:
pd.merge(mergeDataFrame_1,mergeDataFrame_2,on="Name")

       Name    Sports  Calories
0  Mitchell  Swimming       356
1   Cameron      Golf       765
2      Lily   Parkour       123

In [152]:
salaryDict={"Name":["Lorelai","Rory","Dean","Dave"],
           "Department":["Software","Sale","Martketing","Software"],
           "Salary":[240000,340000,440000,540000]
           }

In [154]:
salaryDataFrame=pd.DataFrame(salaryDict)

In [156]:
salaryDataFrame

      Name  Department  Salary
0  Lorelai    Software  240000
1     Rory        Sale  340000
2     Dean  Martketing  440000
3     Dave    Software  540000

In [158]:
salaryDataFrame["Department"].unique()

array(['Software', 'Sale', 'Martketing'], dtype=object)

In [160]:
salaryDataFrame["Department"].nunique()

3

In [162]:
salaryDataFrame["Department"].value_counts()

Department
Software      2
Sale          1
Martketing    1
Name: count, dtype: int64

In [174]:
def grosstoNet(salary):
    return salary*0.66

In [180]:
salaryDataFrame["Salary"].apply(grosstoNet)

0    158400.0
1    224400.0
2    290400.0
3    356400.0
Name: Salary, dtype: float64

In [182]:
salaryDataFrame.isnull()

    Name  Department  Salary
0  False       False   False
1  False       False   False
2  False       False   False
3  False       False   False

In [208]:
newData={"Character":["South Park","South Park","Simpson","Simpson","Simpson"],
        "Character Name":["Cartman","Kenny","Hommer","Bart","Bart"],
         "Character Age":[2,36,45,65,67]
        }

In [210]:
characterDf=pd.DataFrame(newData)

In [212]:
characterDf

    Character Character Name  Character Age
0  South Park        Cartman              2
1  South Park          Kenny             36
2     Simpson         Hommer             45
3     Simpson           Bart             65
4     Simpson           Bart             67

In [218]:
characterDf.pivot_table(values="Character Age",index= ["Character","Character Name"],aggfunc=np.sum) ##When we use aggfunc, it gives the sum of the values of the same names, if we don't write it, it gives the average

C:\Users\beyra\AppData\Local\Temp\ipykernel_17240\3562518070.py:1: FutureWarning: The provided callable <function sum at 0x0000019F9F198CC0> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  characterDf.pivot_table(values="Character Age",index= ["Character","Character Name"],aggfunc=np.sum)

                           Character Age
Character  Character Name
Simpson    Bart                      132
           Hommer                     45
South Park Cartman                     2
           Kenny                      36